contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [5:4] SYS_REPAIR_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_M                             0x00000030
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_S                             4

// Field: [3:0] SYS_WS_READ_STATES
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_M                        0x0000000F
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_S                        0

//*****************************************************************************
//
// Register: FLASH_O_EFUSECRA
//
//*****************************************************************************
// Field: [5:0] DATA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSECRA_DATA_M                                       0x0000003F
#define FLASH_EFUSECRA_DATA_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEREAD
//
//*****************************************************************************
// Field: [9:8] DATABIT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEREAD_DATABIT_M                                   0x00000300
#define FLASH_EFUSEREAD_DATABIT_S                                   8

// Field: [7:4] READCLOCK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEREAD_READCLOCK_M                                 0x000000F0
#define FLASH_EFUSEREAD_READCLOCK_S                                 4

// Field: [3]    DEBUG
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEREAD_DEBUG                                       0x00000008
#define FLASH_EFUSEREAD_DEBUG_BITN                                  3
#define FLASH_EFUSEREAD_DEBUG_M                                     0x00000008
#define FLASH_EFUSEREAD_DEBUG_S                                     3

// Field: [2]    SPARE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEREAD_SPARE                                       0x00000004
#define FLASH_EFUSEREAD_SPARE_BITN                                  2
#define FLASH_EFUSEREAD_SPARE_M                                     0x00000004
#define FLASH_EFUSEREAD_SPARE_S                                     2

// Field: [1:0] MARGIN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEREAD_MARGIN_M                                    0x00000003
#define FLASH_EFUSEREAD_MARGIN_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEPROGRAM
//
//*****************************************************************************
// Field: [30]    COMPAREDISABLE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE                           0x40000000
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_BITN                      30
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_M                         0x40000000
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_S                         30

// Field: [29:14] CLOCKSTALL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_M                             0x3FFFC000
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_S                             14

// Field: [13]    VPPTOVDD
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPROGRAM_VPPTOVDD                                 0x00002000
#define FLASH_EFUSEPROGRAM_VPPTOVDD_BITN                            13
#define FLASH_EFUSEPROGRAM_VPPTOVDD_M                               0x00002000
#define FLASH_EFUSEPROGRAM_VPPTOVDD_S                               13

// Field: [12:9] ITERATIONS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPROGRAM_ITERATIONS_M                             0x00001E00
#define FLASH_EFUSEPROGRAM_ITERATIONS_S                             9

// Field: [8:0] WRITECLOCK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPROGRAM_WRITECLOCK_M                             0x000001FF
#define FLASH_EFUSEPROGRAM_WRITECLOCK_S                             0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEERROR
//
//*****************************************************************************
// Field: [5]    DONE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEERROR_DONE                                       0x00000020
#define FLASH_EFUSEERROR_DONE_BITN                                  5
#define FLASH_EFUSEERROR_DONE_M                                     0x00000020
#define FLASH_EFUSEERROR_DONE_S                                     5

// Field: [4:0] CODE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEERROR_CODE_M                                     0x0000001F
#define FLASH_EFUSEERROR_CODE_S                                     0

//*****************************************************************************
//
// Register: FLASH_O_SINGLEBIT
//
//*****************************************************************************
// Field: [31:1] FROMN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_SINGLEBIT_FROMN_M                                     0xFFFFFFFE
#define FLASH_SINGLEBIT_FROMN_S                                     1

// Field: [0]    FROM0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_SINGLEBIT_FROM0                                       0x00000001
#define FLASH_SINGLEBIT_FROM0_BITN                                  0
#define FLASH_SINGLEBIT_FROM0_M                                     0x00000001
#define FLASH_SINGLEBIT_FROM0_S                                     0

//*****************************************************************************
//
// Register: FLASH_O_TWOBIT
//
//*****************************************************************************
// Field: [31:1] FROMN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_TWOBIT_FROMN_M                                        0xFFFFFFFE
#define FLASH_TWOBIT_FROMN_S                                        1

// Field: [0]    FROM0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_TWOBIT_FROM0                                          0x00000001
#define FLASH_TWOBIT_FROM0_BITN                                     0
#define FLASH_TWOBIT_FROM0_M                                        0x00000001
#define FLASH_TWOBIT_FROM0_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_SELFTESTCYC
//
//*****************************************************************************
// Field: [31:0] CYCLES
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_SELFTESTCYC_CYCLES_M                                  0xFFFFFFFF
#define FLASH_SELFTESTCYC_CYCLES_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_SELFTESTSIGN
//
//*****************************************************************************
// Field: [31:0] SIGNATURE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_SELFTESTSIGN_SIGNATURE_M                              0xFFFFFFFF
#define FLASH_SELFTESTSIGN_SIGNATURE_S                              0

//*****************************************************************************
//
// Register: FLASH_O_FRDCTL
//
//*****************************************************************************
// Field: [11:8] RWAIT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FRDCTL_RWAIT_M                                        0x00000F00
#define FLASH_FRDCTL_RWAIT_S                                        8

//*****************************************************************************
//
// Register: FLASH_O_FSPRD
//
//*****************************************************************************
// Field: [15:8] RMBSEM
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSPRD_RMBSEM_M                                        0x0000FF00
#define FLASH_FSPRD_RMBSEM_S                                        8

// Field: [1]    RM1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSPRD_RM1                                             0x00000002
#define FLASH_FSPRD_RM1_BITN                                        1
#define FLASH_FSPRD_RM1_M                                           0x00000002
#define FLASH_FSPRD_RM1_S                                           1

// Field: [0]    RM0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSPRD_RM0                                             0x00000001
#define FLASH_FSPRD_RM0_BITN                                        0
#define FLASH_FSPRD_RM0_M                                           0x00000001
#define FLASH_FSPRD_RM0_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FEDACCTL1
//
//*****************************************************************************
// Field: [24]    SUSP_IGNR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEDACCTL1_SUSP_IGNR                                   0x01000000
#define FLASH_FEDACCTL1_SUSP_IGNR_BITN                              24
#define FLASH_FEDACCTL1_SUSP_IGNR_M                                 0x01000000
#define FLASH_FEDACCTL1_SUSP_IGNR_S                                 24

//*****************************************************************************
//
// Register: FLASH_O_FEDACSTAT
//
//*****************************************************************************
// Field: [25]    RVF_INT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEDACSTAT_RVF_INT                                     0x02000000
#define FLASH_FEDACSTAT_RVF_INT_BITN                                25
#define FLASH_FEDACSTAT_RVF_INT_M                                   0x02000000
#define FLASH_FEDACSTAT_RVF_INT_S                                   25

// Field: [24]    FSM_DONE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEDACSTAT_FSM_DONE                                    0x01000000
#define FLASH_FEDACSTAT_FSM_DONE_BITN                               24
#define FLASH_FEDACSTAT_FSM_DONE_M                                  0x01000000
#define FLASH_FEDACSTAT_FSM_DONE_S                                  24

//*****************************************************************************
//
// Register: FLASH_O_FBPROT
//
//*****************************************************************************
// Field: [0]    PROTL1DIS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBPROT_PROTL1DIS                                      0x00000001
#define FLASH_FBPROT_PROTL1DIS_BITN                                 0
#define FLASH_FBPROT_PROTL1DIS_M                                    0x00000001
#define FLASH_FBPROT_PROTL1DIS_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FBSE
//
//*****************************************************************************
// Field: [15:0] BSE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSE_BSE_M                                            0x0000FFFF
#define FLASH_FBSE_BSE_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FBBUSY
//
//*****************************************************************************
// Field: [7:0] BUSY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBBUSY_BUSY_M                                         0x000000FF
#define FLASH_FBBUSY_BUSY_S                                         0

//*****************************************************************************
//
// Register: FLASH_O_FBAC
//
//*****************************************************************************
// Field: [16]    OTPPROTDIS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBAC_OTPPROTDIS                                       0x00010000
#define FLASH_FBAC_OTPPROTDIS_BITN                                  16
#define FLASH_FBAC_OTPPROTDIS_M                                     0x00010000
#define FLASH_FBAC_OTPPROTDIS_S                                     16

// Field: [15:8] BAGP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBAC_BAGP_M                                           0x0000FF00
#define FLASH_FBAC_BAGP_S                                           8

