contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [7:0] VREADS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBAC_VREADS_M                                         0x000000FF
#define FLASH_FBAC_VREADS_S                                         0

//*****************************************************************************
//
// Register: FLASH_O_FBFALLBACK
//
//*****************************************************************************
// Field: [27:24] FSM_PWRSAV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_FSM_PWRSAV_M                               0x0F000000
#define FLASH_FBFALLBACK_FSM_PWRSAV_S                               24

// Field: [19:16] REG_PWRSAV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_REG_PWRSAV_M                               0x000F0000
#define FLASH_FBFALLBACK_REG_PWRSAV_S                               16

// Field: [15:14] BANKPWR7
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR7_M                                 0x0000C000
#define FLASH_FBFALLBACK_BANKPWR7_S                                 14

// Field: [13:12] BANKPWR6
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR6_M                                 0x00003000
#define FLASH_FBFALLBACK_BANKPWR6_S                                 12

// Field: [11:10] BANKPWR5
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR5_M                                 0x00000C00
#define FLASH_FBFALLBACK_BANKPWR5_S                                 10

// Field: [9:8] BANKPWR4
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR4_M                                 0x00000300
#define FLASH_FBFALLBACK_BANKPWR4_S                                 8

// Field: [7:6] BANKPWR3
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR3_M                                 0x000000C0
#define FLASH_FBFALLBACK_BANKPWR3_S                                 6

// Field: [5:4] BANKPWR2
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR2_M                                 0x00000030
#define FLASH_FBFALLBACK_BANKPWR2_S                                 4

// Field: [3:2] BANKPWR1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR1_M                                 0x0000000C
#define FLASH_FBFALLBACK_BANKPWR1_S                                 2

// Field: [1:0] BANKPWR0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBFALLBACK_BANKPWR0_M                                 0x00000003
#define FLASH_FBFALLBACK_BANKPWR0_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FBPRDY
//
//*****************************************************************************
// Field: [16]    BANKBUSY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBPRDY_BANKBUSY                                       0x00010000
#define FLASH_FBPRDY_BANKBUSY_BITN                                  16
#define FLASH_FBPRDY_BANKBUSY_M                                     0x00010000
#define FLASH_FBPRDY_BANKBUSY_S                                     16

// Field: [15]    PUMPRDY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBPRDY_PUMPRDY                                        0x00008000
#define FLASH_FBPRDY_PUMPRDY_BITN                                   15
#define FLASH_FBPRDY_PUMPRDY_M                                      0x00008000
#define FLASH_FBPRDY_PUMPRDY_S                                      15

// Field: [0]    BANKRDY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBPRDY_BANKRDY                                        0x00000001
#define FLASH_FBPRDY_BANKRDY_BITN                                   0
#define FLASH_FBPRDY_BANKRDY_M                                      0x00000001
#define FLASH_FBPRDY_BANKRDY_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FPAC1
//
//*****************************************************************************
// Field: [27:16] PSLEEPTDIS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPAC1_PSLEEPTDIS_M                                    0x0FFF0000
#define FLASH_FPAC1_PSLEEPTDIS_S                                    16

// Field: [15:4] PUMPRESET_PW
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPAC1_PUMPRESET_PW_M                                  0x0000FFF0
#define FLASH_FPAC1_PUMPRESET_PW_S                                  4

// Field: [1:0] PUMPPWR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPAC1_PUMPPWR_M                                       0x00000003
#define FLASH_FPAC1_PUMPPWR_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FPAC2
//
//*****************************************************************************
// Field: [15:0] PAGP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPAC2_PAGP_M                                          0x0000FFFF
#define FLASH_FPAC2_PAGP_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FMAC
//
//*****************************************************************************
// Field: [2:0] BANK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMAC_BANK_M                                           0x00000007
#define FLASH_FMAC_BANK_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FMSTAT
//
//*****************************************************************************
// Field: [17]    RVSUSP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_RVSUSP                                         0x00020000
#define FLASH_FMSTAT_RVSUSP_BITN                                    17
#define FLASH_FMSTAT_RVSUSP_M                                       0x00020000
#define FLASH_FMSTAT_RVSUSP_S                                       17

