contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [16]    RDVER
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_RDVER                                          0x00010000
#define FLASH_FMSTAT_RDVER_BITN                                     16
#define FLASH_FMSTAT_RDVER_M                                        0x00010000
#define FLASH_FMSTAT_RDVER_S                                        16

// Field: [15]    RVF
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_RVF                                            0x00008000
#define FLASH_FMSTAT_RVF_BITN                                       15
#define FLASH_FMSTAT_RVF_M                                          0x00008000
#define FLASH_FMSTAT_RVF_S                                          15

// Field: [14]    ILA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_ILA                                            0x00004000
#define FLASH_FMSTAT_ILA_BITN                                       14
#define FLASH_FMSTAT_ILA_M                                          0x00004000
#define FLASH_FMSTAT_ILA_S                                          14

// Field: [13]    DBF
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_DBF                                            0x00002000
#define FLASH_FMSTAT_DBF_BITN                                       13
#define FLASH_FMSTAT_DBF_M                                          0x00002000
#define FLASH_FMSTAT_DBF_S                                          13

// Field: [12]    PGV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_PGV                                            0x00001000
#define FLASH_FMSTAT_PGV_BITN                                       12
#define FLASH_FMSTAT_PGV_M                                          0x00001000
#define FLASH_FMSTAT_PGV_S                                          12

// Field: [11]    PCV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_PCV                                            0x00000800
#define FLASH_FMSTAT_PCV_BITN                                       11
#define FLASH_FMSTAT_PCV_M                                          0x00000800
#define FLASH_FMSTAT_PCV_S                                          11

// Field: [10]    EV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_EV                                             0x00000400
#define FLASH_FMSTAT_EV_BITN                                        10
#define FLASH_FMSTAT_EV_M                                           0x00000400
#define FLASH_FMSTAT_EV_S                                           10

// Field: [9]    CV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_CV                                             0x00000200
#define FLASH_FMSTAT_CV_BITN                                        9
#define FLASH_FMSTAT_CV_M                                           0x00000200
#define FLASH_FMSTAT_CV_S                                           9

// Field: [8]    BUSY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_BUSY                                           0x00000100
#define FLASH_FMSTAT_BUSY_BITN                                      8
#define FLASH_FMSTAT_BUSY_M                                         0x00000100
#define FLASH_FMSTAT_BUSY_S                                         8

// Field: [7]    ERS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_ERS                                            0x00000080
#define FLASH_FMSTAT_ERS_BITN                                       7
#define FLASH_FMSTAT_ERS_M                                          0x00000080
#define FLASH_FMSTAT_ERS_S                                          7

// Field: [6]    PGM
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_PGM                                            0x00000040
#define FLASH_FMSTAT_PGM_BITN                                       6
#define FLASH_FMSTAT_PGM_M                                          0x00000040
#define FLASH_FMSTAT_PGM_S                                          6

// Field: [5]    INVDAT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_INVDAT                                         0x00000020
#define FLASH_FMSTAT_INVDAT_BITN                                    5
#define FLASH_FMSTAT_INVDAT_M                                       0x00000020
#define FLASH_FMSTAT_INVDAT_S                                       5

// Field: [4]    CSTAT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_CSTAT                                          0x00000010
#define FLASH_FMSTAT_CSTAT_BITN                                     4
#define FLASH_FMSTAT_CSTAT_M                                        0x00000010
#define FLASH_FMSTAT_CSTAT_S                                        4

// Field: [3]    VOLSTAT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_VOLSTAT                                        0x00000008
#define FLASH_FMSTAT_VOLSTAT_BITN                                   3
#define FLASH_FMSTAT_VOLSTAT_M                                      0x00000008
#define FLASH_FMSTAT_VOLSTAT_S                                      3

// Field: [2]    ESUSP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_ESUSP                                          0x00000004
#define FLASH_FMSTAT_ESUSP_BITN                                     2
#define FLASH_FMSTAT_ESUSP_M                                        0x00000004
#define FLASH_FMSTAT_ESUSP_S                                        2

// Field: [1]    PSUSP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_PSUSP                                          0x00000002
#define FLASH_FMSTAT_PSUSP_BITN                                     1
#define FLASH_FMSTAT_PSUSP_M                                        0x00000002
#define FLASH_FMSTAT_PSUSP_S                                        1

// Field: [0]    SLOCK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FMSTAT_SLOCK                                          0x00000001
#define FLASH_FMSTAT_SLOCK_BITN                                     0
#define FLASH_FMSTAT_SLOCK_M                                        0x00000001
#define FLASH_FMSTAT_SLOCK_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FLOCK
//
//*****************************************************************************
// Field: [15:0] ENCOM
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FLOCK_ENCOM_M                                         0x0000FFFF
#define FLASH_FLOCK_ENCOM_S                                         0

//*****************************************************************************
//
// Register: FLASH_O_FVREADCT
//
//*****************************************************************************
// Field: [3:0] VREADCT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVREADCT_VREADCT_M                                    0x0000000F
#define FLASH_FVREADCT_VREADCT_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT1
//
//*****************************************************************************
// Field: [23:20] TRIM13_E
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT1_TRIM13_E_M                                    0x00F00000
#define FLASH_FVHVCT1_TRIM13_E_S                                    20

// Field: [19:16] VHVCT_E
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT1_VHVCT_E_M                                     0x000F0000
#define FLASH_FVHVCT1_VHVCT_E_S                                     16

