contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [14:12] VIN_AT_X
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSEQPMP_VIN_AT_X_M                                    0x00007000
#define FLASH_FSEQPMP_VIN_AT_X_S                                    12

// Field: [8]    VIN_BY_PASS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSEQPMP_VIN_BY_PASS                                   0x00000100
#define FLASH_FSEQPMP_VIN_BY_PASS_BITN                              8
#define FLASH_FSEQPMP_VIN_BY_PASS_M                                 0x00000100
#define FLASH_FSEQPMP_VIN_BY_PASS_S                                 8

//*****************************************************************************
//
// Register: FLASH_O_FBSTROBES
//
//*****************************************************************************
// Field: [24]    ECBIT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_ECBIT                                       0x01000000
#define FLASH_FBSTROBES_ECBIT_BITN                                  24
#define FLASH_FBSTROBES_ECBIT_M                                     0x01000000
#define FLASH_FBSTROBES_ECBIT_S                                     24

// Field: [18]    RWAIT2_FLCLK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_RWAIT2_FLCLK                                0x00040000
#define FLASH_FBSTROBES_RWAIT2_FLCLK_BITN                           18
#define FLASH_FBSTROBES_RWAIT2_FLCLK_M                              0x00040000
#define FLASH_FBSTROBES_RWAIT2_FLCLK_S                              18

// Field: [17]    RWAIT_FLCLK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_RWAIT_FLCLK                                 0x00020000
#define FLASH_FBSTROBES_RWAIT_FLCLK_BITN                            17
#define FLASH_FBSTROBES_RWAIT_FLCLK_M                               0x00020000
#define FLASH_FBSTROBES_RWAIT_FLCLK_S                               17

// Field: [16]    FLCLKEN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_FLCLKEN                                     0x00010000
#define FLASH_FBSTROBES_FLCLKEN_BITN                                16
#define FLASH_FBSTROBES_FLCLKEN_M                                   0x00010000
#define FLASH_FBSTROBES_FLCLKEN_S                                   16

// Field: [8]    CTRLENZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_CTRLENZ                                     0x00000100
#define FLASH_FBSTROBES_CTRLENZ_BITN                                8
#define FLASH_FBSTROBES_CTRLENZ_M                                   0x00000100
#define FLASH_FBSTROBES_CTRLENZ_S                                   8

// Field: [6]    NOCOLRED
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_NOCOLRED                                    0x00000040
#define FLASH_FBSTROBES_NOCOLRED_BITN                               6
#define FLASH_FBSTROBES_NOCOLRED_M                                  0x00000040
#define FLASH_FBSTROBES_NOCOLRED_S                                  6

// Field: [5]    PRECOL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_PRECOL                                      0x00000020
#define FLASH_FBSTROBES_PRECOL_BITN                                 5
#define FLASH_FBSTROBES_PRECOL_M                                    0x00000020
#define FLASH_FBSTROBES_PRECOL_S                                    5

// Field: [4]    TI_OTP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_TI_OTP                                      0x00000010
#define FLASH_FBSTROBES_TI_OTP_BITN                                 4
#define FLASH_FBSTROBES_TI_OTP_M                                    0x00000010
#define FLASH_FBSTROBES_TI_OTP_S                                    4

// Field: [3]    OTP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_OTP                                         0x00000008
#define FLASH_FBSTROBES_OTP_BITN                                    3
#define FLASH_FBSTROBES_OTP_M                                       0x00000008
#define FLASH_FBSTROBES_OTP_S                                       3

// Field: [2]    TEZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBSTROBES_TEZ                                         0x00000004
#define FLASH_FBSTROBES_TEZ_BITN                                    2
#define FLASH_FBSTROBES_TEZ_M                                       0x00000004
#define FLASH_FBSTROBES_TEZ_S                                       2

//*****************************************************************************
//
// Register: FLASH_O_FPSTROBES
//
//*****************************************************************************
// Field: [8]    EXECUTEZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPSTROBES_EXECUTEZ                                    0x00000100
#define FLASH_FPSTROBES_EXECUTEZ_BITN                               8
#define FLASH_FPSTROBES_EXECUTEZ_M                                  0x00000100
#define FLASH_FPSTROBES_EXECUTEZ_S                                  8

// Field: [1]    V3PWRDNZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPSTROBES_V3PWRDNZ                                    0x00000002
#define FLASH_FPSTROBES_V3PWRDNZ_BITN                               1
#define FLASH_FPSTROBES_V3PWRDNZ_M                                  0x00000002
#define FLASH_FPSTROBES_V3PWRDNZ_S                                  1

// Field: [0]    V5PWRDNZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FPSTROBES_V5PWRDNZ                                    0x00000001
#define FLASH_FPSTROBES_V5PWRDNZ_BITN                               0
#define FLASH_FPSTROBES_V5PWRDNZ_M                                  0x00000001
#define FLASH_FPSTROBES_V5PWRDNZ_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FBMODE
//
//*****************************************************************************
// Field: [2:0] MODE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FBMODE_MODE_M                                         0x00000007
#define FLASH_FBMODE_MODE_S                                         0

//*****************************************************************************
//
// Register: FLASH_O_FTCR
//
//*****************************************************************************
// Field: [6:0] TCR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FTCR_TCR_M                                            0x0000007F
#define FLASH_FTCR_TCR_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FADDR
//
//*****************************************************************************
// Field: [31:0] FADDR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FADDR_FADDR_M                                         0xFFFFFFFF
#define FLASH_FADDR_FADDR_S                                         0

//*****************************************************************************
//
// Register: FLASH_O_FTCTL
//
//*****************************************************************************
// Field: [16]    WDATA_BLK_CLR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FTCTL_WDATA_BLK_CLR                                   0x00010000
#define FLASH_FTCTL_WDATA_BLK_CLR_BITN                              16
#define FLASH_FTCTL_WDATA_BLK_CLR_M                                 0x00010000
#define FLASH_FTCTL_WDATA_BLK_CLR_S                                 16

// Field: [1]    TEST_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FTCTL_TEST_EN                                         0x00000002
#define FLASH_FTCTL_TEST_EN_BITN                                    1
#define FLASH_FTCTL_TEST_EN_M                                       0x00000002
#define FLASH_FTCTL_TEST_EN_S                                       1

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE0
//
//*****************************************************************************
// Field: [31:0] FWPWRITE0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE0_FWPWRITE0_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE0_FWPWRITE0_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE1
//
//*****************************************************************************
// Field: [31:0] FWPWRITE1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE1_FWPWRITE1_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE1_FWPWRITE1_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE2
//
//*****************************************************************************
// Field: [31:0] FWPWRITE2
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE2_FWPWRITE2_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE2_FWPWRITE2_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE3
//
//*****************************************************************************
// Field: [31:0] FWPWRITE3
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE3_FWPWRITE3_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE3_FWPWRITE3_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE4
//
//*****************************************************************************
// Field: [31:0] FWPWRITE4
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE4_FWPWRITE4_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE4_FWPWRITE4_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE5
//
//*****************************************************************************
// Field: [31:0] FWPWRITE5
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE5_FWPWRITE5_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE5_FWPWRITE5_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE6
//
//*****************************************************************************
// Field: [31:0] FWPWRITE6
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE6_FWPWRITE6_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE6_FWPWRITE6_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE7
//
//*****************************************************************************
// Field: [31:0] FWPWRITE7
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE7_FWPWRITE7_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE7_FWPWRITE7_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE_ECC
//
//*****************************************************************************
// Field: [31:24] ECCBYTES07_00
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_M                          0xFF000000
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_S                          24

// Field: [23:16] ECCBYTES15_08
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_M                          0x00FF0000
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_S                          16

