contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [15:8] ECCBYTES23_16
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_M                          0x0000FF00
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_S                          8

// Field: [7:0] ECCBYTES31_24
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_M                          0x000000FF
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_S                          0

//*****************************************************************************
//
// Register: FLASH_O_FSWSTAT
//
//*****************************************************************************
// Field: [0]    SAFELV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSWSTAT_SAFELV                                        0x00000001
#define FLASH_FSWSTAT_SAFELV_BITN                                   0
#define FLASH_FSWSTAT_SAFELV_M                                      0x00000001
#define FLASH_FSWSTAT_SAFELV_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_GLBCTL
//
//*****************************************************************************
// Field: [0]    CLKSEL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_GLBCTL_CLKSEL                                     0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_BITN                                0
#define FLASH_FSM_GLBCTL_CLKSEL_M                                   0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSM_STATE
//
//*****************************************************************************
// Field: [11]    CTRLENZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STATE_CTRLENZ                                     0x00000800
#define FLASH_FSM_STATE_CTRLENZ_BITN                                11
#define FLASH_FSM_STATE_CTRLENZ_M                                   0x00000800
#define FLASH_FSM_STATE_CTRLENZ_S                                   11

// Field: [10]    EXECUTEZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STATE_EXECUTEZ                                    0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_BITN                               10
#define FLASH_FSM_STATE_EXECUTEZ_M                                  0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_S                                  10

// Field: [8]    FSM_ACT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STATE_FSM_ACT                                     0x00000100
#define FLASH_FSM_STATE_FSM_ACT_BITN                                8
#define FLASH_FSM_STATE_FSM_ACT_M                                   0x00000100
#define FLASH_FSM_STATE_FSM_ACT_S                                   8

// Field: [7]    TIOTP_ACT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STATE_TIOTP_ACT                                   0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_BITN                              7
#define FLASH_FSM_STATE_TIOTP_ACT_M                                 0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_S                                 7

// Field: [6]    OTP_ACT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STATE_OTP_ACT                                     0x00000040
#define FLASH_FSM_STATE_OTP_ACT_BITN                                6
#define FLASH_FSM_STATE_OTP_ACT_M                                   0x00000040
#define FLASH_FSM_STATE_OTP_ACT_S                                   6

//*****************************************************************************
//
// Register: FLASH_O_FSM_STAT
//
//*****************************************************************************
// Field: [2]    NON_OP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STAT_NON_OP                                       0x00000004
#define FLASH_FSM_STAT_NON_OP_BITN                                  2
#define FLASH_FSM_STAT_NON_OP_M                                     0x00000004
#define FLASH_FSM_STAT_NON_OP_S                                     2

// Field: [1]    OVR_PUL_CNT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STAT_OVR_PUL_CNT                                  0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_BITN                             1
#define FLASH_FSM_STAT_OVR_PUL_CNT_M                                0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_S                                1

// Field: [0]    INV_DAT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_STAT_INV_DAT                                      0x00000001
#define FLASH_FSM_STAT_INV_DAT_BITN                                 0
#define FLASH_FSM_STAT_INV_DAT_M                                    0x00000001
#define FLASH_FSM_STAT_INV_DAT_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMD
//
//*****************************************************************************
// Field: [5:0] FSMCMD
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_CMD_FSMCMD_M                                      0x0000003F
#define FLASH_FSM_CMD_FSMCMD_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_OSU
//
//*****************************************************************************
// Field: [15:8] PGM_OSU
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PE_OSU_PGM_OSU_M                                  0x0000FF00
#define FLASH_FSM_PE_OSU_PGM_OSU_S                                  8

// Field: [7:0] ERA_OSU
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PE_OSU_ERA_OSU_M                                  0x000000FF
#define FLASH_FSM_PE_OSU_ERA_OSU_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FSM_VSTAT
//
//*****************************************************************************
// Field: [15:12] VSTAT_CNT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_VSTAT_VSTAT_CNT_M                                 0x0000F000
#define FLASH_FSM_VSTAT_VSTAT_CNT_S                                 12

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VSU
//
//*****************************************************************************
// Field: [15:8] PGM_VSU
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PE_VSU_PGM_VSU_M                                  0x0000FF00
#define FLASH_FSM_PE_VSU_PGM_VSU_S                                  8

// Field: [7:0] ERA_VSU
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PE_VSU_ERA_VSU_M                                  0x000000FF
#define FLASH_FSM_PE_VSU_ERA_VSU_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMP_VSU
//
//*****************************************************************************
// Field: [15:12] ADD_EXZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_CMP_VSU_ADD_EXZ_M                                 0x0000F000
#define FLASH_FSM_CMP_VSU_ADD_EXZ_S                                 12

//*****************************************************************************
//
// Register: FLASH_O_FSM_EX_VAL
//
//*****************************************************************************
// Field: [15:8] REP_VSU
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_EX_VAL_REP_VSU_M                                  0x0000FF00
#define FLASH_FSM_EX_VAL_REP_VSU_S                                  8

// Field: [7:0] EXE_VALD
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_EX_VAL_EXE_VALD_M                                 0x000000FF
#define FLASH_FSM_EX_VAL_EXE_VALD_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_RD_H
//
//*****************************************************************************
// Field: [7:0] RD_H
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_RD_H_RD_H_M                                       0x000000FF
#define FLASH_FSM_RD_H_RD_H_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FSM_P_OH
//
//*****************************************************************************
// Field: [15:8] PGM_OH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_P_OH_PGM_OH_M                                     0x0000FF00
#define FLASH_FSM_P_OH_PGM_OH_S                                     8

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_OH
//
//*****************************************************************************
// Field: [15:0] ERA_OH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ERA_OH_ERA_OH_M                                   0x0000FFFF
#define FLASH_FSM_ERA_OH_ERA_OH_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_PPUL
//
//*****************************************************************************
// Field: [11:0] SAV_P_PUL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_M                              0x00000FFF
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_S                              0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VH
//
//*****************************************************************************
// Field: [15:8] PGM_VH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PE_VH_PGM_VH_M                                    0x0000FF00
#define FLASH_FSM_PE_VH_PGM_VH_S                                    8

//*****************************************************************************
//
// Register: FLASH_O_FSM_PRG_PW
//
//*****************************************************************************
// Field: [15:0] PROG_PUL_WIDTH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_M                           0x0000FFFF
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_S                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_PW
//
//*****************************************************************************
// Field: [31:0] FSM_ERA_PW
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_M                               0xFFFFFFFF
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_S                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_ERA_PUL
//
//*****************************************************************************
// Field: [11:0] SAV_ERA_PUL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_M                         0x00000FFF
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_S                         0

//*****************************************************************************
//
// Register: FLASH_O_FSM_TIMER
//
//*****************************************************************************
// Field: [31:0] FSM_TIMER
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_TIMER_FSM_TIMER_M                                 0xFFFFFFFF
#define FLASH_FSM_TIMER_FSM_TIMER_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_MODE
//
//*****************************************************************************
// Field: [19:18] RDV_SUBMODE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_MODE_RDV_SUBMODE_M                                0x000C0000
#define FLASH_FSM_MODE_RDV_SUBMODE_S                                18

