contiki-os/contiki/cc26xxware/inc/hw_flash.h
// Field: [3:0] FSM_ERR_BANK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ERR_ADDR_FSM_ERR_BANK_M                           0x0000000F
#define FLASH_FSM_ERR_ADDR_FSM_ERR_BANK_S                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PGM_MAXPUL
//
//*****************************************************************************
// Field: [11:0] FSM_PGM_MAXPUL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_PGM_MAXPUL_FSM_PGM_MAXPUL_M                       0x00000FFF
#define FLASH_FSM_PGM_MAXPUL_FSM_PGM_MAXPUL_S                       0

//*****************************************************************************
//
// Register: FLASH_O_FSM_EXECUTE
//
//*****************************************************************************
// Field: [19:16] SUSPEND_NOW
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_EXECUTE_SUSPEND_NOW_M                             0x000F0000
#define FLASH_FSM_EXECUTE_SUSPEND_NOW_S                             16

// Field: [4:0] FSMEXECUTE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_EXECUTE_FSMEXECUTE_M                              0x0000001F
#define FLASH_FSM_EXECUTE_FSMEXECUTE_S                              0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SECTOR1
//
//*****************************************************************************
// Field: [31:0] FSM_SECTOR1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_SECTOR1_FSM_SECTOR1_M                             0xFFFFFFFF
#define FLASH_FSM_SECTOR1_FSM_SECTOR1_S                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SECTOR2
//
//*****************************************************************************
// Field: [31:0] FSM_SECTOR2
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_SECTOR2_FSM_SECTOR2_M                             0xFFFFFFFF
#define FLASH_FSM_SECTOR2_FSM_SECTOR2_S                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLE0
//
//*****************************************************************************
// Field: [31:0] FSM_BSLE0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_BSLE0_FSM_BSLE0_M                                 0xFFFFFFFF
#define FLASH_FSM_BSLE0_FSM_BSLE0_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLE1
//
//*****************************************************************************
// Field: [31:0] FSM_BSL1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_BSLE1_FSM_BSL1_M                                  0xFFFFFFFF
#define FLASH_FSM_BSLE1_FSM_BSL1_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLP0
//
//*****************************************************************************
// Field: [31:0] FSM_BSLP0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_BSLP0_FSM_BSLP0_M                                 0xFFFFFFFF
#define FLASH_FSM_BSLP0_FSM_BSLP0_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLP1
//
//*****************************************************************************
// Field: [31:0] FSM_BSL1
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_BSLP1_FSM_BSL1_M                                  0xFFFFFFFF
#define FLASH_FSM_BSLP1_FSM_BSL1_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_BANK
//
//*****************************************************************************
// Field: [31:20] EE_BANK_WIDTH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_BANK_EE_BANK_WIDTH_M                             0xFFF00000
#define FLASH_FCFG_BANK_EE_BANK_WIDTH_S                             20

// Field: [19:16] EE_NUM_BANK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_BANK_EE_NUM_BANK_M                               0x000F0000
#define FLASH_FCFG_BANK_EE_NUM_BANK_S                               16

// Field: [15:4] MAIN_BANK_WIDTH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_BANK_MAIN_BANK_WIDTH_M                           0x0000FFF0
#define FLASH_FCFG_BANK_MAIN_BANK_WIDTH_S                           4

// Field: [3:0] MAIN_NUM_BANK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_BANK_MAIN_NUM_BANK_M                             0x0000000F
#define FLASH_FCFG_BANK_MAIN_NUM_BANK_S                             0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_WRAPPER
//
//*****************************************************************************
// Field: [31:24] FAMILY_TYPE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_WRAPPER_FAMILY_TYPE_M                            0xFF000000
#define FLASH_FCFG_WRAPPER_FAMILY_TYPE_S                            24

// Field: [20]    MEM_MAP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_WRAPPER_MEM_MAP                                  0x00100000
#define FLASH_FCFG_WRAPPER_MEM_MAP_BITN                             20
#define FLASH_FCFG_WRAPPER_MEM_MAP_M                                0x00100000
#define FLASH_FCFG_WRAPPER_MEM_MAP_S                                20

// Field: [19:16] CPU2
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FCFG_WRAPPER_CPU2_M                                   0x000F0000
#define FLASH_FCFG_WRAPPER_CPU2_S                                   16

